[
  {
    "lang": "it",
    "title": "La Stella Polare Scomparsa",
    "story": "Il team lavora da sei mesi su un prodotto e-commerce. Ogni Sprint produce funzionalità finite, ma dopo l'ennesima Sprint Review il CTO sbotta: 'Stiamo costruendo tutto e niente. Non so dove stiamo andando.' Il PO risponde che ha sempre consegnato ciò che era richiesto sprint per sprint. Nessuno sa dire qual è il traguardo finale del prodotto, né perché certe funzionalità siano state prioritizzate rispetto ad altre. Il team è tecnicamente efficiente ma strategicamente cieco.",
    "hint": "C'è un impegno a lungo termine che dovrebbe orientare ogni decisione sul Product Backlog, ma in questo team non esiste.",
    "correctLocation": "Refinement",
    "explanationLocation": "È durante le sessioni di Refinement che il team dovrebbe verificare costantemente se i PBI sono allineati con un obiettivo di prodotto di lungo periodo. Senza Product Goal, il Refinement diventa pura tattica senza strategia.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner è accountable per sviluppare ed esplicitare il Product Goal. Non basta consegnare feature sprint per sprint: il PO deve garantire che il lavoro del team si muova verso una visione coerente del prodotto.",
    "correctWeapon": "Product Goal",
    "explanationWeapon": "Il Product Goal è il commitment del Product Backlog (Scrum Guide 2020). Senza di esso, il team produce incrementi validi ma non sa verso quale futuro stato del prodotto stia lavorando, rendendo impossibile prendere buone decisioni di prioritizzazione."
  },
  {
    "lang": "en",
    "title": "The Missing North Star",
    "story": "The team has been working on an e-commerce product for six months. Every Sprint produces finished features, but after yet another Sprint Review the CTO snaps: 'We're building everything and nothing. I don't know where we're going.' The PO replies that they've always delivered what was requested sprint by sprint. Nobody can articulate the final destination of the product, or why certain features were prioritized over others. The team is technically efficient but strategically blind.",
    "hint": "There's a long-term commitment that should guide every Product Backlog decision — but in this team it simply doesn't exist.",
    "correctLocation": "Refinement",
    "explanationLocation": "During Refinement, the team should constantly verify whether PBIs are aligned with a long-term product objective. Without a Product Goal, Refinement becomes pure tactics with no strategy.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner is accountable for developing and explicitly communicating the Product Goal. Delivering features sprint by sprint is not enough: the PO must ensure the team's work moves toward a coherent product vision.",
    "correctWeapon": "Product Goal",
    "explanationWeapon": "The Product Goal is the commitment of the Product Backlog (Scrum Guide 2020). Without it, the team produces valid increments but has no target future state to work toward, making it impossible to make good prioritization decisions."
  },
  {
    "lang": "it",
    "title": "Il Caso dello Sprint Eterno",
    "story": "Un'azienda manifatturiera ha adottato Scrum per sviluppare il suo nuovo gestionale interno. Il responsabile IT ha convinto tutti che, data la complessità del progetto, gli Sprint dovrebbero durare 'almeno due mesi' per avere risultati significativi. Dopo il terzo Sprint da otto settimane, il team ha prodotto molto lavoro, ma i requisiti sono già cambiati due volte, il feedback degli utenti finali arriva sempre troppo tardi e l'incertezza cresce invece di diminuire.",
    "hint": "La durata di uno Sprint non è arbitraria: esiste un limite preciso definito dalla Scrum Guide, e non è un caso.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "La durata dello Sprint viene stabilita in fase di Sprint Planning. È in quel momento che avrebbe dovuto essere corretta, rispettando il massimo previsto dalla Scrum Guide.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master è accountable per far sì che Scrum venga applicato correttamente. Avrebbe dovuto intervenire per far rispettare il limite massimo di un mese, spiegando che Sprint troppo lunghi aumentano il rischio e riducono i benefici dell'empirismo.",
    "correctWeapon": "Sprint",
    "explanationWeapon": "La Scrum Guide definisce che uno Sprint non può superare un mese di calendario. Sprint più brevi limitano i rischi, aumentano la prevedibilità e permettono di incorporare feedback prima che l'investimento sbagliato diventi troppo costoso da correggere."
  },
  {
    "lang": "en",
    "title": "The Case of the Eternal Sprint",
    "story": "A manufacturing company has adopted Scrum to develop its new internal management system. The IT manager convinced everyone that, given the project's complexity, Sprints should last 'at least two months' to yield meaningful results. After the third eight-week Sprint, the team has produced a lot of work, but requirements have already changed twice, end-user feedback always arrives too late, and uncertainty grows instead of shrinking.",
    "hint": "Sprint length is not arbitrary: the Scrum Guide sets a precise maximum, and it's not by accident.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "Sprint length is established during Sprint Planning. That is the moment it should have been corrected, adhering to the maximum defined by the Scrum Guide.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master is accountable for ensuring Scrum is applied correctly. They should have intervened to enforce the one-month maximum, explaining that overly long Sprints increase risk and reduce the benefits of empiricism.",
    "correctWeapon": "Sprint",
    "explanationWeapon": "The Scrum Guide states that a Sprint cannot exceed one calendar month. Shorter Sprints limit risk, increase predictability, and allow feedback to be incorporated before a wrong investment becomes too costly to correct."
  },
  {
    "lang": "it",
    "title": "Il Caso del Termometro Spezzato",
    "story": "Il management ha chiesto allo Scrum Master di condividere la velocity del team ogni settimana. Ben presto la velocity diventa l'obiettivo principale: il team inizia a sovrastimare i punti delle story per sembrare più produttivo, a dividere artificialmente i task per chiuderli prima e a evitare di segnalare impedimenti per non rallentare i numeri. La qualità cala, il debito tecnico cresce, ma i grafici sono sempre verdi.",
    "hint": "Una metrica nata per aiutare la pianificazione diventa un'arma quando viene usata per valutare le persone invece del processo.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "Alla Sprint Review il management avrebbe dovuto valutare il valore dell'Incremento consegnato, non un numero astratto. È l'evento in cui l'ispezione empirica dell'Incremento dovrebbe guidare le decisioni, non i KPI interni.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master avrebbe dovuto proteggere il team dall'uso distorto delle metriche, spiegare la differenza tra indicatori di pianificazione e KPI valutativi, e favorire una cultura di miglioramento continuo basata sulla qualità del prodotto.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "Lo Sprint Backlog è diventato uno strumento di manipolazione invece che di trasparenza. Quando il team manipola le stime e i task per gonfiare i numeri, lo Sprint Backlog cessa di rappresentare la realtà e smette di essere un piano adattabile."
  },
  {
    "lang": "en",
    "title": "The Case of the Broken Thermometer",
    "story": "Management asked the Scrum Master to share the team's velocity weekly. Velocity soon became the primary target: the team started inflating story points to appear more productive, artificially splitting tasks to close them faster, and avoiding reporting impediments to keep the numbers up. Quality declined, technical debt grew, but the charts were always green.",
    "hint": "A metric born to help planning becomes a weapon when it's used to evaluate people instead of the process.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "At the Sprint Review, management should have been evaluating the value of the delivered Increment, not an abstract number. It is the event where empirical inspection of the Increment should drive decisions, not internal KPIs.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master should have protected the team from misuse of metrics, explained the difference between planning indicators and evaluative KPIs, and fostered a culture of continuous improvement based on product quality.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "The Sprint Backlog became a tool for manipulation instead of transparency. When the team games estimates and tasks to inflate numbers, the Sprint Backlog no longer represents reality and ceases to function as an adaptable plan."
  },
  {
    "lang": "it",
    "title": "Il Caso della Platea Vuota",
    "story": "Tristan (il PO) organizza la Sprint Review ogni due settimane, ma con il tempo ha smesso di invitare gli stakeholder perché 'fanno domande scomode' e 'rallentano il processo'. Il team mostra il lavoro a sé stesso e al PO, raccoglie zero feedback esterno, e prosegue verso il prossimo Sprint. Al lancio del prodotto, le sorprese sono amare: gli utenti non vogliono ciò che è stato costruito.",
    "hint": "C'è un evento Scrum il cui scopo principale è raccogliere feedback dal mondo esterno al team. Senza partecipanti esterni, quell'evento perde il suo senso.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "La Sprint Review non è una demo interna: è un evento di ispezione dell'Incremento a cui partecipano gli stakeholder chiave. Il suo valore sta proprio nel feedback esterno che permette di adattare il Product Backlog.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner è responsabile di invitare e coinvolgere gli stakeholder alla Sprint Review. Escluderli per evitare domande difficili nega al team informazioni critiche per massimizzare il valore del prodotto.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "Il Product Backlog non viene mai aggiornato in base a feedback reale degli stakeholder. Senza gli input della Review, rimane uno strumento di pianificazione cieco, disconnesso dalle reali esigenze del mercato."
  },
  {
    "lang": "en",
    "title": "The Case of the Empty Audience",
    "story": "Tristan (the PO) organizes the Sprint Review every two weeks, but over time has stopped inviting stakeholders because they 'ask uncomfortable questions' and 'slow down the process.' The team shows their work to themselves and the PO, collects zero external feedback, and moves on to the next Sprint. At product launch, the surprises are bitter: users don't want what was built.",
    "hint": "There is a Scrum event whose primary purpose is to collect feedback from the world outside the team. Without external participants, that event loses its meaning.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "The Sprint Review is not an internal demo: it is an Increment inspection event in which key stakeholders participate. Its value lies precisely in the external feedback that allows adaptation of the Product Backlog.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner is responsible for inviting and engaging stakeholders at the Sprint Review. Excluding them to avoid difficult questions deprives the team of critical information needed to maximize product value.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "The Product Backlog is never updated based on real stakeholder feedback. Without Review inputs, it remains a blind planning tool, disconnected from the actual needs of the market."
  },
  {
    "lang": "it",
    "title": "Il Caso del Capo Travestito",
    "story": "Layla è la Scrum Master del team da tre mesi. Ogni mattina al Daily Scrum fa il giro dei Developer chiedendo: 'Cosa hai fatto ieri? Cosa farai oggi? Hai blocchi?' Assegna personalmente i task ai Developer all'inizio di ogni Sprint e aggiorna lei stessa il board. Il team la trova utile e organizzata. Ma i Developer non si parlano più tra loro: aspettano le istruzioni di Layla e non si sentono responsabili delle proprie scelte.",
    "hint": "C'è un evento Scrum che appartiene ai Developer e non allo Scrum Master. Trasformarlo in un meeting di status reporting è un antipattern classico.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "Il Daily Scrum è un evento dei Developers, per i Developers. Lo Scrum Master non è tenuto a parteciparvi né a facilitarlo: il suo ruolo è insegnare al team a tenerlo in autonomia, non condurlo.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master ha assunto comportamenti da project manager classico, violando il principio di auto-gestione del team. La Scrum Guide è esplicita: i Developers scelgono come strutturare il Daily Scrum. Lo SM deve farsi da parte.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "I Developers hanno rinunciato a gestire il proprio Sprint Backlog in autonomia. L'artefatto è nelle mani dello Scrum Master invece che del team, eliminando la responsabilità collettiva e l'adattamento quotidiano del piano."
  },
  {
    "lang": "en",
    "title": "The Case of the Disguised Manager",
    "story": "Layla has been the team's Scrum Master for three months. Every morning at the Daily Scrum she goes around asking each Developer: 'What did you do yesterday? What will you do today? Any blockers?' She personally assigns tasks to Developers at the start of each Sprint and updates the board herself. The team finds her helpful and organized. But Developers no longer talk to each other: they wait for Layla's instructions and don't feel responsible for their own choices.",
    "hint": "There is a Scrum event that belongs to the Developers, not the Scrum Master. Turning it into a status reporting meeting is a classic anti-pattern.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "The Daily Scrum is an event by Developers, for Developers. The Scrum Master is not required to attend or facilitate it: their role is to teach the team to run it independently, not to lead it.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master has taken on classic project manager behaviors, violating the team's self-management principle. The Scrum Guide is explicit: Developers choose how to structure their Daily Scrum. The SM must step back.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "The Developers have given up self-managing their own Sprint Backlog. The artifact is in the Scrum Master's hands instead of the team's, eliminating collective ownership and daily adaptation of the plan."
  },
  {
    "lang": "it",
    "title": "Il Caso del Treno che Non Si Ferma",
    "story": "A metà Sprint, il PO riceve una notizia bomba: il principale competitor ha lanciato una funzionalità identica a quella che il team sta sviluppando, rendendo il lavoro corrente quasi inutile. Il PO lo comunica al team, che suggerisce di cambiare direzione. Ma lo Scrum Master insiste: 'Non si tocca niente, finiamo lo Sprint come pianificato.' Il PO, in difficoltà, cede alla pressione. Il team consegna qualcosa che nessuno vuole più e perde due settimane preziose.",
    "hint": "Esistono circostanze eccezionali in cui uno Sprint può essere interrotto. Chi ha bloccato l'unica persona autorizzata a farlo?",
    "correctLocation": "During Sprint",
    "explanationLocation": "La Scrum Guide prevede che uno Sprint possa essere cancellato se lo Sprint Goal diventa obsoleto. Quella decisione va presa durante lo Sprint, non rimangiarsi il problema fino alla fine.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master ha commesso il crimine: imponendo di continuare lo Sprint, ha usurpato una decisione che spetta esclusivamente al Product Owner. Il suo ruolo è servire il team e l'organizzazione, non esercitare autorità sul processo in modo dogmatico. Avrebbe dovuto ricordare al PO che aveva il diritto — e in quel contesto il dovere — di cancellare lo Sprint.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "Lo Sprint Goal era diventato obsoleto nel momento in cui il competitor ha reso inutile la funzionalità in sviluppo. La Scrum Guide è chiara: se lo Sprint Goal non ha più senso, lo Sprint può essere cancellato. Bloccare questa opzione significa sprecare deliberatamente valore e violare l'empirismo di Scrum."
  },
  {
    "lang": "en",
    "title": "The Case of the Train That Won't Stop",
    "story": "Mid-Sprint, the PO receives a bombshell: the main competitor has launched a feature identical to what the team is developing, making the current work nearly worthless. The PO informs the team, who suggests changing direction. But the Scrum Master insists: 'Nothing changes, we finish the Sprint as planned.' The PO, under pressure, backs down. The team delivers something nobody wants anymore and loses two precious weeks.",
    "hint": "There are exceptional circumstances in which a Sprint can be cancelled. Who blocked the only person authorized to do so?",
    "correctLocation": "During Sprint",
    "explanationLocation": "The Scrum Guide states that a Sprint can be cancelled if the Sprint Goal becomes obsolete. That decision must be made during the Sprint, not swept under the rug until the end.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master committed the crime: by insisting the Sprint continue, they usurped a decision that belongs exclusively to the Product Owner. Their role is to serve the team and the organization, not to exercise authority over the process dogmatically. They should have reminded the PO that they had the right — and in that context the duty — to cancel the Sprint.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "The Sprint Goal had become obsolete the moment the competitor rendered the feature in development worthless. The Scrum Guide is clear: if the Sprint Goal is no longer valid, the Sprint can be cancelled. Blocking this option means deliberately wasting value and violating Scrum's empiricism."
  },
  {
    "lang": "it",
    "title": "Il Caso del Backlog Senza Fondo",
    "story": "Il Product Backlog del team conta 847 item. Molti sono stati scritti due anni fa e non sono mai stati rivisti. Durante il Refinement, il PO aggiunge continuamente nuovi item senza rimuovere quelli obsoleti. I Developer faticano a capire cosa sia davvero prioritario e cosa sia 'rumore'. Alla Sprint Planning, la selezione degli item richiede ore di discussione perché nessuno è davvero chiaro su cosa significhino le voci in cima alla lista.",
    "hint": "Un artefatto Scrum deve essere trasparente. Se diventa un cassetto del caos, tradisce il suo scopo.",
    "correctLocation": "Refinement",
    "explanationLocation": "Il Refinement è l'attività continuativa in cui il Product Backlog viene mantenuto ordinato, aggiornato e comprensibile. È il momento in cui rimuovere item obsoleti, aggiornare le priorità e garantire che i PBI in cima siano davvero pronti.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner è accountable per la gestione efficace del Product Backlog, che include mantenerlo trasparente, visibile e comprensibile. Un backlog di 847 item irrisolti è una chiara violazione di questa responsabilità.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "Il Product Backlog ha perso la sua funzione di strumento di pianificazione trasparente. La Scrum Guide richiede che sia ordinato e che rifletta le priorità reali: un backlog caotico genera confusione, rallenta la pianificazione e impedisce decisioni di valore."
  },
  {
    "lang": "en",
    "title": "The Case of the Bottomless Backlog",
    "story": "The team's Product Backlog has 847 items. Many were written two years ago and have never been reviewed. During Refinement, the PO continuously adds new items without removing obsolete ones. Developers struggle to understand what is truly prioritized and what is just 'noise.' At Sprint Planning, selecting items takes hours of discussion because nobody is really clear on what the items at the top of the list even mean.",
    "hint": "A Scrum artifact must be transparent. If it becomes a drawer of chaos, it betrays its purpose.",
    "correctLocation": "Refinement",
    "explanationLocation": "Refinement is the ongoing activity in which the Product Backlog is kept ordered, updated, and understandable. It is the moment to remove obsolete items, update priorities, and ensure that PBIs at the top are truly ready.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner is accountable for effective Product Backlog management, which includes keeping it transparent, visible, and understood. A backlog of 847 unresolved items is a clear violation of this accountability.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "The Product Backlog has lost its function as a transparent planning tool. The Scrum Guide requires it to be ordered and to reflect real priorities: a chaotic backlog generates confusion, slows planning, and prevents value-based decisions."
  },
  {
    "lang": "it",
    "title": "Lo Strano Caso dei Requisiti Mutanti",
    "story": "A metà dello Sprint in corso, la direzione del prodotto ha deciso di aggiungere due nuove funzionalità molto urgenti da rilasciare immediatamente. Il team ha dovuto mettere in pausa i lavori in corso, iniziare i nuovi sviluppi e ha fallito completamente l'obiettivo originale dello Sprint. Alcuni test sono stati saltati per la fretta.",
    "hint": "Lo scopo dello Sprint è proteggere il team garantendogli la concentrazione.",
    "correctLocation": "During Sprint",
    "explanationLocation": "Il problema si è verificato durante lo svolgimento dello Sprint, alterando il piano di lavoro concordato e mettendo a rischio lo Sprint Goal.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner è l'unico che può modificare lo scope dello Sprint o negoziare una cancellazione; non ha protetto il team e l'obiettivo concordato di fronte alle pressioni esterne.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "Lo Sprint Goal è l'impegno che protegge la concentrazione del team per tutta la durata dello Sprint; ignorarlo o abbandonarlo è l'antipattern che ha causato il fallimento."
  },
  {
    "lang": "en",
    "title": "The Strange Case of Mutant Requirements",
    "story": "Halfway through the current Sprint, product management decided to add two new very urgent features to be released immediately. The team had to pause their ongoing work, start the new developments, and completely failed the original Sprint goal. Some tests were skipped due to the rush.",
    "hint": "The purpose of the Sprint is to protect the team by guaranteeing them concentration.",
    "correctLocation": "During Sprint",
    "explanationLocation": "The problem occurred during the execution of the Sprint, altering the agreed-upon work plan and putting the Sprint Goal at risk.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner is the only one who can modify the Sprint scope or negotiate a cancellation; they failed to protect the team and the agreed goal when facing external pressure.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "The Sprint Goal is the commitment that protects the team's focus for the entire Sprint; ignoring or abandoning it is the anti-pattern that caused the failure."
  },
  {
    "lang": "it",
    "title": "Il Caso dell'Isola che Non C'è",
    "story": "Si è appena concluso lo Sprint e il team sta mostrando il lavoro fatto all'evento finale. Tutto sembra funzionare a dovere nel codice locale di ogni sviluppatore, ma non appena viene chiesto di vedere il prodotto in un ambiente reale (staging o produzione), il team ammette che 'è quasi finito ma mancano solo i test e il deploy'. Di fatto l'incremento non è rilasciabile.",
    "hint": "Se non c'è una chiara regola condivisa su quando un lavoro può dirsi completato, allora niente è mai finito.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "Durante la Sprint Review viene esaminato solo l'Incremento 'Finito'. Non si dovrebbe portare lavoro parziale non rilasciabile.",
    "correctSuspect": "DEV Team",
    "explanationSuspect": "Spetta ai Developers garantire e applicare tutele di qualità (Definition of Done) trasformando gli item in un incremento utilizzabile.",
    "correctWeapon": "Definition of Done",
    "explanationWeapon": "Ignorare la Definition of Done porta a discrepanze su cosa significhi 'terminare un task', generando debito tecnico e inaffidabilità."
  },
  {
    "lang": "en",
    "title": "The Case of Neverland",
    "story": "The Sprint has just ended and the team is showing the work done at the final event. Everything seems to work properly in each developer's local code, but as soon as they are asked to see the product in a real environment (staging or production), the team admits that 'it's almost finished but only lacks tests and deployment'. In fact, the increment is not releasable.",
    "hint": "If there is no clear shared rule on when a job can be called completed, then nothing is ever really finished.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "During the Sprint Review, only the 'Done' Increment is examined. Non-releasable partial work should not be brought here.",
    "correctSuspect": "DEV Team",
    "explanationSuspect": "It is up to the Developers to ensure and apply quality safeguards (Definition of Done) turning items into a usable increment.",
    "correctWeapon": "Definition of Done",
    "explanationWeapon": "Ignoring the Definition of Done leads to discrepancies on what 'finishing a task' means, generating technical debt and unreliability."
  },
  {
    "lang": "it",
    "title": "Il Caso del Proprietario Fantasma",
    "story": "Socrates (il PO) è sempre troppo impegnato con gli stakeholder e non si presenta mai alle sessioni di Refinement o Sprint Planning. I Developer hanno cercato di interpretare il Backlog da soli, ma allo Sprint Review il risultato è stato un disastro: l'Incremento non serve a nulla e non rispecchia le necessità del mercato. I Developer dicono di non averlo voluto 'disturbare'.",
    "hint": "Senza la presenza della persona che guida il valore, il team naviga alla cieca.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "Lo Sprint Planning richiede la collaborazione di tutto lo Scrum Team. Senza il PO, non si può definire un obiettivo di valore.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner deve essere disponibile per il team; la sua assenza è la causa principale del disallineamento.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "Il Backlog non è stato rifinito né spiegato, diventando un'arma contundente contro l'efficacia del team."
  },
  {
    "lang": "en",
    "title": "The Case of the Ghost Owner",
    "story": "Socrates (the PO) is always too busy with stakeholders and never shows up for Refinement or Sprint Planning sessions. The Developers tried to interpret the Backlog on their own, but at the Sprint Review, the result was a disaster: the Increment is useless and doesn't meet market needs. Developers said they didn't want to 'bother' him.",
    "hint": "Without the presence of the person driving the value, the team is sailing blind.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "Sprint Planning requires the collaboration of the entire Scrum Team. Without the PO, a valuable Sprint Goal cannot be defined.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner must be available to the team; their absence is the root cause of the misalignment.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "The Backlog was neither refined nor explained, becoming an obstacle to the team's effectiveness."
  },
  {
    "lang": "it",
    "title": "Il Caso del Silenzio Colpevole",
    "story": "Durante lo Sprint, un errore nel database ha causato un'incoerenza dei dati critica. Il Developer che ha commesso l'errore ha avuto paura di parlarne, sperando di risolverlo in segreto, e non ha detto nulla durante il Daily Scrum. Il problema è emerso solo quando il sistema è andato in crash totale poco prima della Review.",
    "hint": "La trasparenza è un pilastro di Scrum; nascondere la polvere sotto il tappeto non aiuta mai.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "Il Daily Scrum è il momento in cui gli ostacoli devono essere portati alla luce per permettere l'ispezione e l'adattamento.",
    "correctSuspect": "DEV Team",
    "explanationSuspect": "I Developer hanno la responsabilità della trasparenza tecnica verso i colleghi per risolvere i problemi collettivamente.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "Il Developer non ha aggiornato lo Sprint Backlog per rendere visibile l'impedimento. Lo Sprint Backlog è l'artefatto che deve rivelare la verità sul progresso e i rischi dello Sprint."
  },
  {
    "lang": "en",
    "title": "The Case of the Guilty Silence",
    "story": "During the Sprint, a database error caused critical data inconsistency. The Developer who made the mistake was afraid to talk about it, hoping to fix it in secret, and said nothing during the Daily Scrum. The problem emerged only when the system crashed completely just before the Review.",
    "hint": "Transparency is a pillar of Scrum; hiding dirt under the rug never helps.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "The Daily Scrum is the moment when impediments must be brought to light to allow for inspection and adaptation.",
    "correctSuspect": "DEV Team",
    "explanationSuspect": "Developers have a responsibility for technical transparency toward their peers to solve problems collectively.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "The Developer failed to update the Sprint Backlog to make the impediment visible. The Sprint Backlog is the artifact that must reveal the truth about progress and Sprint risks."
  },
  {
    "lang": "it",
    "title": "Il Caso del Circolo Ristretto",
    "story": "Mariana (lo Scrum Master) ha notato che il PO si confronta sempre e solo con lo stesso gruppetto di 4 Developer per definire i futuri lavori. Il resto del team si sente escluso e non capisce la direzione del prodotto, limitandosi a eseguire task senza contesto. Questo sta creando un team a 'due velocità'.",
    "hint": "L'attività di Refinement dovrebbe coinvolgere e attivare l'intero team, non solo un'élite.",
    "correctLocation": "Refinement",
    "explanationLocation": "Il Refinement è un'attività del team; escludere membri riduce l'intelligenza collettiva del gruppo.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il PO non dovrebbe creare barriere o circoli ristretti, ma favorire la comprensione condivisa di tutti.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "Il modo in cui viene gestito il Backlog è diventato un mezzo di esclusione invece che uno strumento di allineamento."
  },
  {
    "lang": "en",
    "title": "The Case of the Inner Circle",
    "story": "Mariana (the Scrum Master) noticed that the PO always and only consults with the same group of 4 Developers to define future work. The rest of the team feels excluded and doesn't understand the product direction, just executing tasks without context. This is creating a 'two-speed' team.",
    "hint": "Refinement activities should engage the entire team, not just an elite group.",
    "correctLocation": "Refinement",
    "explanationLocation": "Refinement is a team activity; excluding members reduces the collective intelligence of the group.",
    "correctSuspect": "PO",
    "explanationSuspect": "The PO should not create barriers or inner circles, but foster shared understanding among everyone.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "The way the Backlog is managed has become a means of exclusion rather than an alignment tool."
  },
  {
    "lang": "it",
    "title": "Il Mistero del Backlog Vuoto di Senso",
    "story": "Durante lo Sprint Planning, il team si trova davanti a un Backlog ricco di item dettagliatissimi sul 'come' costruire ogni funzionalità, ma nessuno sa rispondere alla domanda 'perché stiamo costruendo questo adesso?' Il PO elenca le feature prioritarie con sicurezza, ma quando un Developer chiede 'qual è il focus di questo Sprint?', nella stanza cala un silenzio imbarazzante. Alla fine vengono selezionati item a caso, ognuno lavora sulla propria parte e lo Sprint termina senza che nessuno riesca a raccontare agli stakeholder cos'è stato davvero consegnato.",
    "hint": "Un Backlog ben ordinato non è sufficiente se manca qualcosa che trasformi una lista di task in una direzione condivisa.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "È durante lo Sprint Planning che il PO propone uno Sprint Goal e il team lo negozia. Se questo passaggio non avviene, il Planning produce una lista di task invece di un piano orientato al valore.",
    "correctSuspect": "PO",
    "explanationSuspect": "Il Product Owner ha la responsabilità di proporre uno Sprint Goal durante il Planning. Portare item tecnici ben scritti ma privi di un filo condiviso significa aver preparato il Backlog ma non la direzione dello Sprint.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "Lo Sprint Goal non è un optional: è il commitment dello Sprint che dà al team un obiettivo unificante, permette di prendere decisioni durante lo Sprint e comunica valore agli stakeholder. Senza di esso, ogni Sprint è una corsa senza traguardo."
  },
  {
    "lang": "en",
    "title": "The Mystery of the Meaningless Backlog",
    "story": "During Sprint Planning, the team faces a Backlog full of highly detailed items about 'how' to build each feature, but nobody can answer the question 'why are we building this now?' The PO lists the priority features with confidence, but when a Developer asks 'what is the focus of this Sprint?', an awkward silence fills the room. Items are eventually selected at random, everyone works on their own piece, and the Sprint ends without anyone being able to tell stakeholders what was actually delivered.",
    "hint": "A well-ordered Backlog is not enough if something is missing that turns a list of tasks into a shared direction.",
    "correctLocation": "Sprint Planning",
    "explanationLocation": "It is during Sprint Planning that the PO proposes a Sprint Goal and the team negotiates it. If this step doesn't happen, Planning produces a task list instead of a value-oriented plan.",
    "correctSuspect": "PO",
    "explanationSuspect": "The Product Owner is responsible for proposing a Sprint Goal during Planning. Bringing well-written technical items without a shared thread means having prepared the Backlog but not the Sprint's direction.",
    "correctWeapon": "Sprint Goal",
    "explanationWeapon": "The Sprint Goal is not optional: it is the Sprint's commitment that gives the team a unifying objective, enables decisions during the Sprint, and communicates value to stakeholders. Without it, every Sprint is a race without a finish line."
  },
  {
    "lang": "it",
    "title": "Il Silenzio che Uccide la Retro",
    "story": "Prima della Retrospective, tre Developer avevano confidato allo Scrum Master Kenji i veri problemi del team: una pipeline di CI/CD rotta da settimane che costringeva ognuno a fare deploy manuale, e una tensione crescente con il PO che cambiava le acceptance criteria a Sprint quasi concluso. Kenji apre la Retrospective con un icebreaker, raccoglie post-it generici sulla lavagna e conclude dopo venti minuti con due action item vaghi: 'migliorare la comunicazione' e 'fare meglio i test'. I problemi reali non vengono mai nominati. La settimana successiva, tutto ricomincia come prima.",
    "hint": "Qualcuno in quella stanza sapeva esattamente cosa non andava, ma ha scelto di non portarlo alla luce. Il coraggio è un valore Scrum.",
    "correctLocation": "Retrospective",
    "explanationLocation": "La Sprint Retrospective è l'evento dedicato all'ispezione del modo di lavorare del team. È l'unico spazio formale per affrontare impedimenti di processo, relazionali e tecnici ricorrenti.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master era a conoscenza dei problemi reali prima dell'evento e non li ha portati in superficie. La Scrum Guide assegna allo SM la responsabilità di facilitare la Retrospective in modo che sia positiva e produttiva. Evitare il conflitto non è facilitazione: è complicità nel mantenere lo status quo.",
    "correctWeapon": "Sprint Retrospective",
    "explanationWeapon": "La Retrospective stessa è l'arma del delitto: usata come rituale vuoto invece che come strumento di miglioramento reale, diventa un alibi per non cambiare nulla. Un evento Scrum che non produce adattamento concreto tradisce uno dei tre pilastri dell'empirismo: l'adattamento."
  },
  {
    "lang": "en",
    "title": "The Silence That Kills the Retro",
    "story": "Before the Retrospective, three Developers had confided in Scrum Master Kenji the team's real problems: a CI/CD pipeline broken for weeks forcing manual deploys, and growing tension with the PO who kept changing acceptance criteria near the end of the Sprint. Kenji opens the Retrospective with an icebreaker, collects generic post-its on the board, and wraps up after twenty minutes with two vague action items: 'improve communication' and 'do better testing'. The real problems are never named. The following week, everything starts over as before.",
    "hint": "Someone in that room knew exactly what was wrong, but chose not to bring it to light. Courage is a Scrum value.",
    "correctLocation": "Retrospective",
    "explanationLocation": "The Sprint Retrospective is the event dedicated to inspecting the team's way of working. It is the only formal space to address recurring process, relational, and technical impediments.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master was aware of the real problems before the event and did not surface them. The Scrum Guide assigns the SM responsibility for facilitating the Retrospective so that it is positive and productive. Avoiding conflict is not facilitation: it is complicity in maintaining the status quo.",
    "correctWeapon": "Sprint Retrospective",
    "explanationWeapon": "The Retrospective itself is the murder weapon: used as an empty ritual instead of a real improvement tool, it becomes an alibi for changing nothing. A Scrum event that produces no concrete adaptation betrays one of the three pillars of empiricism: adaptation."
  },
  {
    "lang": "it",
    "title": "Il Caso dei Silos che Nessuno Vuole Abbattere",
    "story": "L'azienda ha adottato Scrum da quattro mesi. Lo Scrum Master Omar ha notato fin dal primo Sprint che nessun team riesce mai a consegnare un Incremento completo: il team front-end finisce il suo pezzo, ma dipende dal back-end che non ha ancora esposto le API, che a sua volta aspetta il team database. Omar partecipa a ogni Daily, vede le dipendenze bloccarsi settimana dopo settimana, ma non dice nulla perché 'è una decisione organizzativa e non spetta a lui'. Alla quinta Sprint Review consecutiva senza nulla di funzionante da mostrare, il management chiede spiegazioni.",
    "hint": "Scrum non funziona con Component Team. Lo Scrum Master lo sa, lo vede ogni giorno, ma ha scelto di non agire.",
    "correctLocation": "During Sprint",
    "explanationLocation": "Il problema si manifesta durante ogni Sprint: le dipendenze tra team organizzati per strato tecnologico impediscono la creazione di qualsiasi Incremento funzionante entro il timebox.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Lo Scrum Master è accountable per rimuovere gli impedimenti al progresso del team e per guidare l'organizzazione nell'adozione di Scrum. Tacere di fronte a una struttura organizzativa che rende impossibile applicare Scrum non è rispetto dei confini: è un fallimento della propria responsabilità verso l'organizzazione.",
    "correctWeapon": "Increment",
    "explanationWeapon": "L'Increment è la vittima: senza team cross-funzionali, non esiste la possibilità di produrre software funzionante entro uno Sprint. La Scrum Guide è esplicita — i Developers devono avere tutte le competenze necessarie per creare valore ogni Sprint, senza dipendenze esterne."
  },
  {
    "lang": "en",
    "title": "The Case of the Silos Nobody Wants to Break",
    "story": "The company has been using Scrum for four months. Scrum Master Omar noticed from the very first Sprint that no team ever manages to deliver a complete Increment: the front-end team finishes their piece, but depends on the back-end team that hasn't exposed the APIs yet, which in turn waits for the database team. Omar participates in every Daily, watches the dependencies block progress week after week, but says nothing because 'it's an organizational decision and not his place.' At the fifth consecutive Sprint Review with nothing working to show, management demands an explanation.",
    "hint": "Scrum doesn't work with Component Teams. The Scrum Master knows this, sees it every day, but chose not to act.",
    "correctLocation": "During Sprint",
    "explanationLocation": "The problem manifests during every Sprint: dependencies between teams organized by technical layer prevent the creation of any working Increment within the timebox.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Master is accountable for removing impediments to the team's progress and for guiding the organization in adopting Scrum. Staying silent in the face of an organizational structure that makes Scrum impossible is not respecting boundaries: it is a failure of one's accountability toward the organization.",
    "correctWeapon": "Increment",
    "explanationWeapon": "The Increment is the victim: without cross-functional teams, it is impossible to produce working software within a Sprint. The Scrum Guide is explicit — Developers must have all the skills necessary to create value every Sprint, without external dependencies."
  },
  {
    "lang": "it",
    "title": "Il Muro che Nessuno Ha Rimosso",
    "story": "Durante il terzo Sprint consecutivo, il team si imbatte nello stesso identico blocco: l'ambiente di test non è aggiornato e i Developer non hanno i permessi per farlo autonomamente. Ogni mattina al Daily Scrum qualcuno lo menziona, lo Scrum Master Priya lo annota scrupolosamente nel suo documento degli impedimenti e risponde 'me ne occupo io'. Ma i giorni passano, il blocco rimane, il team inizia a lavorare di sera per recuperare il tempo perso, e alla Review mancano due feature che tutti davano per pronte.",
    "hint": "Segnalare un impedimento non basta. C'è qualcuno il cui ruolo è assicurarsi che venga davvero rimosso.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "Il Daily Scrum è il momento in cui gli impedimenti vengono identificati. Ma l'evento non risolve i problemi da solo: serve che qualcuno agisca concretamente dopo di esso. L'impedimento era visibile ogni giorno e nessuno ha escalato né risolto.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "La Scrum Guide assegna allo Scrum Master la responsabilità esplicita di rimuovere gli impedimenti al progresso del team. Annotare il problema senza risolverlo o escalarlo è una forma di inazione che viola direttamente questa accountability.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "Lo Sprint Backlog mostrava ogni giorno l'impedimento irrisolto, ma nessuno ha adattato il piano di conseguenza né agito per sbloccare la situazione. Un piano che non si adatta di fronte agli ostacoli non è empirismo: è esecuzione cieca."
  },
  {
    "lang": "en",
    "title": "The Wall Nobody Removed",
    "story": "During the third consecutive Sprint, the team hits the same exact blocker: the test environment is outdated and Developers don't have permissions to update it themselves. Every morning at the Daily Scrum someone mentions it, Scrum Master Priya dutifully notes it in her impediment log and replies 'I'll take care of it.' But the days pass, the blocker remains, the team starts working evenings to recover lost time, and at the Review two features everyone considered ready are missing.",
    "hint": "Flagging an impediment is not enough. There is someone whose role is to make sure it actually gets removed.",
    "correctLocation": "Daily Scrum",
    "explanationLocation": "The Daily Scrum is when impediments are identified. But the event doesn't solve problems on its own: someone needs to act concretely after it. The impediment was visible every day and nobody escalated or resolved it.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "The Scrum Guide explicitly assigns the Scrum Master responsibility for removing impediments to the team's progress. Logging the problem without resolving or escalating it is a form of inaction that directly violates this accountability.",
    "correctWeapon": "Sprint Backlog",
    "explanationWeapon": "The Sprint Backlog showed the unresolved impediment every day, but nobody adapted the plan accordingly or acted to unblock the situation. A plan that doesn't adapt in the face of obstacles isn't empiricism: it's blind execution."
  },
  {
    "lang": "it",
    "title": "Il Caso della Review che Nessuno Ricordava",
    "story": "Alla prima Sprint Review del nuovo team, il PO è visibilmente deluso: l'Incremento non rispecchia minimamente le sue aspettative. I Developer si difendono: 'Abbiamo seguito le descrizioni del backlog alla lettera. Avevamo dei dubbi, ma sembravi sempre così occupato che non osavamo scriverti.' Lo Scrum Master Jonas ascolta in silenzio. Nella Retrospective della settimana prima, qualcuno aveva già detto 'non sappiamo mai se stiamo costruendo la cosa giusta', ma Jonas aveva chiuso la discussione dicendo 'ne parliamo col PO al prossimo Planning'. Quel momento non è mai arrivato.",
    "hint": "Qualcuno aveva già sentito l'allarme suonare. Il coraggio di agire sui valori Scrum non può essere rimandato a domani.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "Il disastro esplode alla Sprint Review, ma le radici affondano in tutto lo Sprint. È l'evento che rende visibile il fallimento di un intero ciclo di collaborazione mancata.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Jonas sapeva già dalla Retrospective precedente che il team non si sentiva allineato col PO, e ha rimandato invece di agire. La Scrum Guide assegna allo Scrum Master la responsabilità di promuovere i valori Scrum — in particolare il coraggio e l'apertura — e di aiutare il team a migliorare le pratiche di interazione. Rimandare un problema noto è una scelta attiva.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "Il Product Backlog non era sufficientemente chiaro e condiviso da permettere al team di capire il valore da consegnare. Ma il vero crimine non è la qualità degli item: è che nessuno ha creato lo spazio per chiarirli durante lo Sprint, quando c'era ancora tempo."
  },
  {
    "lang": "en",
    "title": "The Case of the Review Nobody Remembered",
    "story": "At the first Sprint Review of the new team, the PO is visibly disappointed: the Increment doesn't meet expectations at all. The Developers defend themselves: 'We followed the backlog descriptions to the letter. We had doubts, but you always seemed so busy we didn't dare write to you.' Scrum Master Jonas listens in silence. In the previous week's Retrospective, someone had already said 'we never know if we're building the right thing', but Jonas had closed the discussion saying 'let's talk to the PO at the next Planning.' That moment never came.",
    "hint": "Someone had already heard the alarm go off. The courage to act on Scrum values cannot be postponed until tomorrow.",
    "correctLocation": "Sprint Review",
    "explanationLocation": "The disaster explodes at the Sprint Review, but its roots run through the entire Sprint. It is the event that makes visible the failure of a whole cycle of missed collaboration.",
    "correctSuspect": "Scrum Master",
    "explanationSuspect": "Jonas already knew from the previous Retrospective that the team didn't feel aligned with the PO, and chose to postpone instead of acting. The Scrum Guide assigns the Scrum Master responsibility for promoting Scrum values — particularly courage and openness — and for helping the team improve interaction practices. Deferring a known problem is an active choice.",
    "correctWeapon": "Product Backlog",
    "explanationWeapon": "The Product Backlog was not clear or shared enough to allow the team to understand the value to deliver. But the real crime is not the quality of the items: it's that nobody created space to clarify them during the Sprint, when there was still time."
  }
]